exercise_dict = {
    "胸": {
        "中下胸": [
            {
                "動作": "槓鈴臥推",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 20,
                "老人危險度": 26
            },
            {
                "動作": "啞鈴平躺臥推",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 23,
                "老人危險度": 28
            },
            {
                "動作": "雙槓臂屈伸",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 19,
                "老人危險度": 21
            },
            {
                "動作": "CABLE夾胸(滑輪高位)",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 12,
                "老人危險度": 13
            }
        ],
        "上胸肌": [
            {
                "動作": "上斜槓鈴臥推",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 19,
                "老人危險度": 22
            },
            {
                "動作": "上斜啞鈴臥推",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 18,
                "老人危險度": 23
            },
            {
                "動作": "啞鈴上斜飛鳥",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 18,
                "老人危險度": 24
            },
            {
                "動作": "CABLE夾胸(滑輪低位)",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 12,
                "老人危險度": 13
            }
        ],
        "胸大肌": [
            {
                "動作": "機械式夾胸",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 12,
                "老人危險度": 13
            },
            {
                "動作": "CABLE夾胸(滑輪與胸平行)",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 12,
                "老人危險度": 13
            },
            {
                "動作": "啞鈴上斜夾胸",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 18,
                "老人危險度": 24
            }
        ]
    },
    "手臂": {
        "二頭(短頭)": [
            {
                "動作": "集中彎舉",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 16,
                "老人危險度": 20
            },
            {
                "動作": "槓鈴寬握彎舉",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 19,
                "老人危險度": 24
            },
            {
                "動作": "EZ槓彎舉(站姿)",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 19,
                "老人危險度": 23
            }
        ],
        "二頭(長頭)": [
            {
                "動作": "啞鈴交替彎舉",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 16,
                "老人危險度": 20
            },
            {
                "動作": "槌式彎舉",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 19,
                "老人危險度": 21
            },
            {
                "動作": "傾斜啞鈴彎舉",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 19,
                "老人危險度": 21
            },
            {
                "動作": "機械二頭灣舉訓練機",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 11,
                "老人危險度": 11
            }
        ],
        "三頭": [
            {
                "動作": "窄握臥推",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 18,
                "老人危險度": 22
            },
            {
                "動作": "CABLE繩索下壓",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 11,
                "老人危險度": 12
            },
            {
                "動作": "機械式三頭訓練機",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 11,
                "老人危險度": 13
            },
            {
                "動作": "頭後啞鈴單手伸展",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 18,
                "老人危險度": 23
            },
            {
                "動作": "雙槓臂屈伸",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 19,
                "老人危險度": 21
            }
        ],
        "前臂": [
            {
                "動作": "啞鈴正握腕彎舉",
                "次數": [
                    12,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    45,
                    60
                ],
                "一般人危險度": 18,
                "老人危險度": 21
            },
            {
                "動作": "啞鈴反握腕彎舉",
                "次數": [
                    12,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    45,
                    60
                ],
                "一般人危險度": 18,
                "老人危險度": 21
            },
            {
                "動作": "腕力棒轉動訓練",
                "次數": [
                    10,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    45,
                    60
                ],
                "一般人危險度": 10,
                "老人危險度": 10
            }
        ]
    },
    "腿": {
        "股四頭": [
            {
                "動作": "槓鈴深蹲",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 25,
                "老人危險度": 28
            },
            {
                "動作": "腿推機(踩的部位較為中間)",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 12,
                "老人危險度": 16
            },
            {
                "動作": "腿部伸展機",
                "次數": [
                    12,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 11,
                "老人危險度": 13
            },
            {
                "動作": "啞鈴保加利亞分腿蹲",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 10,
                "老人危險度": 13
            }
        ],
        "股二頭": [
            {
                "動作": "羅馬尼亞硬舉",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 24,
                "老人危險度": 27
            },
            {
                "動作": "腿後側彎舉機",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 10,
                "老人危險度": 11
            },
            {
                "動作": "臀橋",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 10,
                "老人危險度": 11
            },
            {
                "動作": "腿推機(踩的部位較為上面)",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 12,
                "老人危險度": 16
            }
        ]
    },
    "臀": {
        "臀肌": [
            {
                "動作": "臀橋",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 10,
                "老人危險度": 11
            },
            {
                "動作": "弓箭步",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 8,
                "老人危險度": 9
            },
            {
                "動作": "Cable 後踢腿",
                "次數": [
                    12,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 9,
                "老人危險度": 9
            },
            {
                "動作": "站姿後蹬腿",
                "次數": [
                    12,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 7,
                "老人危險度": 7
            },
            {
                "動作": "壺鈴硬舉",
                "次數": [
                    12,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 15,
                "老人危險度": 18
            }
        ]
    },
    "背": {
        "背擴肌": [
            {
                "動作": "引體向上",
                "次數": [
                    6,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 13,
                "老人危險度": 17
            },
            {
                "動作": "高位下拉",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90
                ],
                "一般人危險度": 13,
                "老人危險度": 15
            },
            {
                "動作": "坐姿划船",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90
                ],
                "一般人危險度": 11,
                "老人危險度": 11
            },
            {
                "動作": "屈體划船",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90
                ],
                "一般人危險度": 18,
                "老人危險度": 22
            },
            {
                "動作": "寬握彎舉槓鈴划船",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90
                ],
                "一般人危險度": 20,
                "老人危險度": 24
            }
        ],
        "斜方肌": [
            {
                "動作": "啞鈴聳肩",
                "次數": [
                    12,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 18,
                "老人危險度": 21
            },
            {
                "動作": "槓鈴聳肩",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 19,
                "老人危險度": 23
            },
            {
                "動作": "拉力機直立划船（高拉）",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 13,
                "老人危險度": 14
            }
        ],
        "中下背": [
            {
                "動作": "羅馬尼亞硬舉",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 24,
                "老人危險度": 27
            },
            {
                "動作": "槓鈴划船",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 21,
                "老人危險度": 24
            },
            {
                "動作": "超人式",
                "次數": [
                    15,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 9,
                "老人危險度": 9
            },
            {
                "動作": "背屈身",
                "次數": [
                    15,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 8,
                "老人危險度": 9
            },
            {
                "動作": "CABLE直臂下拉",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 12,
                "老人危險度": 12
            }
        ]
    },
    "肩": {
        "前束": [
            {
                "動作": "啞鈴肩推",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    90
                ],
                "一般人危險度": 18,
                "老人危險度": 20
            },
            {
                "動作": "槓鈴肩推",
                "次數": [
                    8,
                    12
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    90,
                    120
                ],
                "一般人危險度": 21,
                "老人危險度": 23
            },
            {
                "動作": "啞鈴前平舉",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 15,
                "老人危險度": 17
            },
            {
                "動作": "機械式肩推",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 13,
                "老人危險度": 13
            }
        ],
        "中束": [
            {
                "動作": "啞鈴側平舉",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 13,
                "老人危險度": 17
            },
            {
                "動作": "拉力機側平舉",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 10,
                "老人危險度": 13
            },
            {
                "動作": "機械式側平舉",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 10,
                "老人危險度": 13
            }
        ],
        "後束": [
            {
                "動作": "俯身飛鳥（啞鈴）",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 15,
                "老人危險度": 19
            },
            {
                "動作": "反向飛鳥（機械式）",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 16,
                "老人危險度": 20
            },
            {
                "動作": "拉力機反向拉伸",
                "次數": [
                    12,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 11,
                "老人危險度": 11
            }
        ]
    },
    "核心": {
        "腹": [
            {
                "動作": "機械式捲腹",
                "次數": [
                    15,
                    25
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    45,
                    60
                ],
                "一般人危險度": 5,
                "老人危險度": 7
            },
            {
                "動作": "仰臥起坐",
                "次數": [
                    15,
                    25
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    45,
                    60
                ],
                "一般人危險度": 6,
                "老人危險度": 6
            },
            {
                "動作": "捲腹",
                "次數": [
                    15,
                    25
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    45,
                    60
                ],
                "一般人危險度": 6,
                "老人危險度": 6
            },
            {
                "動作": "V-up",
                "次數": [
                    12,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 6,
                "老人危險度": 6
            },
            {
                "動作": "懸垂舉腿",
                "次數": [
                    10,
                    15
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60,
                    90
                ],
                "一般人危險度": 9,
                "老人危險度": 9
            },
            {
                "動作": "俄羅斯轉體",
                "次數": [
                    20,
                    30
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    45,
                    60
                ],
                "一般人危險度": 6,
                "老人危險度": 6
            }
        ]
    },
    "有氧": {
        "全身": [
            {
                "動作": "跑步機慢跑",
                "次數": [
                    20,
                    40
                ],
                "組數": [
                    1
                ],
                "休息": [
                    0
                ],
                "一般人危險度": 7,
                "老人危險度": 7
            },
            {
                "動作": "飛輪車",
                "次數": [
                    20,
                    40
                ],
                "組數": [
                    1
                ],
                "休息": [
                    0
                ],
                "一般人危險度": 10,
                "老人危險度": 11
            },
            {
                "動作": "划船機",
                "次數": [
                    20,
                    40
                ],
                "組數": [
                    1
                ],
                "休息": [
                    0
                ],
                "一般人危險度": 9,
                "老人危險度": 12
            },
            {
                "動作": "登階機",
                "次數": [
                    10,
                    30
                ],
                "組數": [
                    1
                ],
                "休息": [
                    0
                ],
                "一般人危險度": 13,
                "老人危險度": 14
            },
            {
                "動作": "戰繩間歇",
                "次數": [
                    30,
                    60
                ],
                "組數": [
                    3,
                    5
                ],
                "休息": [
                    30,
                    60
                ],
                "一般人危險度": 9,
                "老人危險度": 8
            },
            {
                "動作": "波比跳",
                "次數": [
                    10,
                    20
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 13,
                "老人危險度": 14
            },
            {
                "動作": "跳繩",
                "次數": [
                    60,
                    120
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    30,
                    60
                ],
                "一般人危險度": 13,
                "老人危險度": 14
            },
            {
                "動作": "登山跑",
                "次數": [
                    60,
                    90
                ],
                "組數": [
                    3,
                    4
                ],
                "休息": [
                    60
                ],
                "一般人危險度": 8,
                "老人危險度": 10
            }
        ]
    }
}